Revit 2026 API

# StructuralSectionUtilsSetStructuralSection Method

---

Set structural section in element.

**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool SetStructuralSection(
	Document document,
	ElementId familySymbolId,
	StructuralSection structuralSection
)
```
```vb
Public Shared Function SetStructuralSection (
	document As Document,
	familySymbolId As ElementId,
	structuralSection As StructuralSection
) As Boolean
```
```cpp
public:
static bool SetStructuralSection(
	Document^ document,
	ElementId^ familySymbolId,
	StructuralSection^ structuralSection
)
```
```fsharp
static member SetStructuralSection :
        document : Document *
        familySymbolId : ElementId *
        structuralSection : StructuralSection -> bool
```

#### Parameters

document Document
     The document that owns the family for beam, brace or structural column.
familySymbolId ElementId
     ID of family symbol for beam, brace or structural column.
structuralSection StructuralSection
     Structural section with values that will be set.

#### Return Value

Boolean True is returned when requested shape with values was properly set. Return false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Only beams, braces and structural columns can have structural section associated with it.

#### Reference

StructuralSectionUtils Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace